[{"sent_1": "In order to sautee a cup of onions, Carol will need to use 2 tablespoons of olive oil.", "sent_2": "In order to sautee a cup of onions, Carol will need to use 10 tablespoon of olive oil.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "You can walk more than 10 miles in a hour, if you keep a steady pace of 20 miles per hour.", "sent_2": "You can walk 10 miles in a hour, if you keep a steady pace of 5 miles per hour.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Jimmy wanted to feed 5 people, so he made 1 can of soup.  ", "sent_2": "Jimmy wanted to make dinner just for himself, so he made 1 can of soup.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "10 people will be coming to the party, so it is very likely that 5 cups should be enough.", "sent_2": "10 people will be coming to the party, so it is very likely that 20 cups should be enough.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you run 10 miles, you will feel tired.", "sent_2": "If you run 10 miles, you will feel well rested.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "I wanted to eat eggs, I boiled 4 eggs, peeled it and ate it.", "sent_2": "I wanted to eat eggs, I boiled 4 potatoes, peeled it and ate it.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Sarah left for 5:30 mass at 5:00 in order to be early; it was about a mile away.", "sent_2": "Sarah left for 5:30 mass at 5:00 in order to be early; it was about 50 miles away.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Jenna is five feet tall. Since she can just barely reach the apples growing on the tree, so can her sister who's five feet and six inches.", "sent_2": "Jenna is five feet tall. Since she can just barely reach the apples growing on the tree, so can her sister who's four feet and six inches.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you want a snack, you would be satisfied eating twenty cherries.", "sent_2": "If you want a snack, you would be satisfied eating twenty bananas.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "I am five feet tall, so I can take things from the lower shelves in a supermarket.", "sent_2": "I am five feet tall, so I can take things from the higher shelves in a supermarket.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The car seats four people, so Jerry and his three friends can ride in it together.", "sent_2": "The car seats four people, so Jerry and his four friends can ride in it together.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "My piano weighs 1000 pounds so I need at least four people to help me with the heavy lifting.", "sent_2": "My piano weighs 1000 pounds so I don't need any help with the heavy lifting.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Because she could life the 20 lbs weight without a problem, we knew she could easily life the 10 lb weight as well.", "sent_2": "Because she could life the 20 lbs weight without a problem, we knew she could easily life the 100 lb weight as well.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As three workers can load the suitcases, it should be quicker for five workers to do so.", "sent_2": "As three workers can load the suitcases, it should be quicker for one worker to do so.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As he didn't have a match to light the fire, he could use a mirror instead.", "sent_2": "As he didn't have a match to light the fire, he could use a feather instead.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Taking out the little brush, it is best if this brush has thin bristles in order to clean the gaps found on a keyboard surface.", "sent_2": "Taking out the little brush, it is best if this brush has thick bristles in order to clean the gaps found on a keyboard surface.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you place a dry piece of paper into an open flame it will likely catch fire.", "sent_2": "If you place a dry piece of paper into an open flame it will not likely catch fire.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you cannot find a broom you can sweep crumbs with water.", "sent_2": "If you cannot find a broom you can sweep crumbs with towels.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you plug in earbuds into your laptop's microphone jack, they'll function as microphones.", "sent_2": "If you plug in earbuds into your laptop's microphone jack, they'll function as earphones.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jim needed to lather on his shaving cream so he grabbed his comb.", "sent_2": "Jim needed to lather on his shaving cream so he grabbed his brush.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Icicles were dangling from the roof because the attic was too warm.", "sent_2": "Icicles were dangling from the roof because the attic was insulated.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Joe was an environmentalist, so he was more likely to use reusable shopping bags when out.", "sent_2": "Joe was an environmentalist, so he was more likely to use Styrofoam containers when out.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Needing to clean the condensation off of the refrigerator door, a wet rag will do the trick.", "sent_2": "Needing to clean the condensation off of the refrigerator door, a dry rag will do the trick.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": " If we don't close that door, an intruder could open it and walk in.", "sent_2": " If we don't close that door, an intruder could walk right through it.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Traffic was heavy, so he decided to leave for work early today.", "sent_2": "Traffic was heavy, so he decided to leave for work later than usual today.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you have a new shredder you should place it at eye level so you don't lean over the sharp machinery.", "sent_2": "If you have a new shredder you should place it on the ground so you don't lean over the sharp machinery.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Because my natural hair color is black, if I dye my hair dark brown, people will likely notice.", "sent_2": "Because my natural hair color is black, if I dye my hair blonde, people will likely notice.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "There are crumbs all over the floor and they need to be cleaned up, I should do this with the vacuum. ", "sent_2": "There are crumbs all over the floor and they need to be cleaned up, I should do this with the garbage can. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "As the ball dropped in Times Square I put on my sunglasses to minimize the light reflected from it which was brighter than the moon's.", "sent_2": "As the ball dropped in Times Square I put on my sunglasses to minimize the light's reflection from it which was brighter than the sun 's.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The safest place to keep a glass full of fruit punch is on a table.", "sent_2": "The safest place to keep a glass full of fruit punch is on top of the stove.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "A child with braces is likely to turn down an offer of chewy candy.", "sent_2": "A child with braces is unlikely to turn down an offer of chewy candy.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If my refrigerator stops working, I can put my food outside in the sun until it is fixed.", "sent_2": "If my refrigerator stops working, I can put my food outside in the snow until it is fixed.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since I crushed the cardboard box, it became smaller in size.", "sent_2": "Since I crushed the cardboard box, it became larger in size.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If the television is not working, you can check the outlet to see if it is plugged in.", "sent_2": "If the pencil is not working, you can check the outlet to see if it is plugged in.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you constantly lift watermelons, you might get muscles.", "sent_2": "If you constantly lift thimbles, you might get muscles.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The sun shines brightly in the blue clear sky. You should not stare at it directly.", "sent_2": "The sun shines brightly in the blue clear sky. You should stare at it directly.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you feel drowsy while working an office job, you should stand up while working for a few minutes.", "sent_2": "If you feel drowsy while working an office job, you should sit down while working for a few minutes.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "I didn't want the ice cream to melt, so I put it in the freezer.", "sent_2": "I didn't want the ice cream to melt, so I put it in the oven.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Donald is very ill. He will need someone to get groceries for him.", "sent_2": "Donald is very ill. He will not need anyone to get groceries for him.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you do not have rice for Chinese food dinner, you can use barley as substitute.", "sent_2": "If you do not have rice for Chinese food dinner, you can use wheat as substitute.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since I'm feeling warm, drinking some ice water would help cool me down.", "sent_2": "Since I'm feeling warm, drinking a hot tea would help cool me down.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Because John removed the steering wheel from his Mercedes, he can't drive the Mercedes, as it is, to the beach.", "sent_2": "Because John removed the steering wheel from his Mercedes, he can drive the Mercedes, as it is, to the beach.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "There was a stain on my t-shirt, and I wanted to get it out, so I rubbed it into the shirt, causing the stain to fade.", "sent_2": "There was a stain on my t-shirt, and I wanted to get it out, so I rubbed it into the shirt, causing the stain to darken.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "An easy way to get past a locked house door is with a lockpick.", "sent_2": "An easy way to get past a locked house door is with a car key.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If I spill water on the floor, I would use my handkerchief to clean it up.", "sent_2": "If I spill water on the floor, I would use my hair to clean it up.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The size small bikini is too small for Amanda to wear, so the size medium might fit instead.", "sent_2": "The size small bikini is too big for Amanda to wear, so the size medium might fit instead.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If it is raining, I should ask my guests to take off their shoes before they come in my house.", "sent_2": "If it is raining, I should not ask my guests to take off their shoes before they come in my house.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "When adjusting music volume levels to their max settings, it will increase the likelihood of hearing loss. ", "sent_2": "When adjusting music volume levels to their max settings, it will improve a person's hearing. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jerry Keeps the pair of Rain Coat with her, because the weather is Rainy", "sent_2": "Jerry Keeps the pair of Rain Coat with her, because the weather is too hot", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since he has a microwave, he can reheat the pizza in a ceramic plate.", "sent_2": "Since he has a microwave, he can reheat the pizza in a metal plate.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Tim's hair is short so he doesn't have to use as much conditioner.", "sent_2": "Tim's hair is long so he doesn't have to use as much conditioner.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Bob's coffee mug was missing so he used a styrofoam cup.", "sent_2": "Bob's coffee mug was missing so he used a plastic cup.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The hungry kittens solved their problem by tearing into a bag of dog food.", "sent_2": "The hungry kittens solved their problem by tearing into a can of dog food.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Drinking gasoline will cause health issues.", "sent_2": "Drinking gasoline will not cause health issues.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "As she didn't have a hammer, she could try to pound the nail in with a shoe.", "sent_2": "Since she didn't have a hammer, she could try to pound the nail in with a screwdriver. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since the floor is wet, you should probably put a warning sign to alert the customers.", "sent_2": "Since the floor is wet, you should probably put a tarp to alert the customers.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If a fence is not installed on the property, the dogs could leave the yard.", "sent_2": "If a fence is not installed on the property, the dogs can't leave the yard.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "To pull something small from a drain you could use a vacuum.", "sent_2": "To pull something small from a drain you could use a log.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "I love going to the mall to get some fresh air", "sent_2": "I love going to the forest to get some fresh air", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since she didn't have a hair tie, Cassie used a scarf to keep the hair out of her face.", "sent_2": "Since she didn't have a hair tie, Cassie used a necklace to keep the hair out of her face ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you do not have a drain cleaning tool you could try using a hanger.", "sent_2": "If you do not have a drain cleaning tool you could try using a cord.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "During the heat wave, many people decided to turn their air conditioners on.", "sent_2": "During the cold snap, many people decided to turn their air conditioners on.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jonathan was craving for a coffee, he visited a café and ordered a coffee.", "sent_2": "Jonathan was craving for a coffee, he visited a café and ordered a tea.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If the leaves of a tree fall, it does not mean it is Autumn.", "sent_2": "If the leaves of a tree fall, it means it is Autumn.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Fred is building a house out of sand, so he will probably use buckets and water to construct it.", "sent_2": "Fred is building a house out of sand, so he will probably use hammers and nails to construct it.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jim needed to buy drinks for his family for their week long vacation, so he bought a couple bottles of water.", "sent_2": "Jim needed to buy drinks for his family for their week long vacation, so he bought many bottles of water.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "They wanted to read at night so they put out the lights", "sent_2": "They wanted to read at night so they put on the lights", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "causal", "numeracy": "False"}, {"sent_1": "He works in a building only two blocks away from his house, so he doesn't have to drive there.", "sent_2": "He works in a building only two blocks away from his house, so he can only get there quickly by car.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Molly had thought it would take her six hours to move.  She was happy when it took her three hours to move. ", "sent_2": "Molly had thought it would take her three hours to move.  She was happy when it took her six hours to move. ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Frank was able to find his favorite socks easily among the other sixty five pairs in his drawer.", "sent_2": "Frank was able to find his favorite socks easily among the other three pairs in his drawer.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since Sarah has three years left at college, she'd be wise to get a 10 hour a week job.", "sent_2": "Since Sarah has three years left at college, she'd be wise to get a 60 hour a week job.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Heather's son Mike is six and her daughter Nellie is seventeen. Heather allows Mike to drive home from school unsupervised but has Nellie take the bus.", "sent_2": "Heather's son Mike is six and her daughter Nellie is seventeen. Heather allows Nellie to drive home from school unsupervised but has Mike take the bus.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "With a grocery budget of $200, she cannot buy more than $200 worth of groceries.", "sent_2": "With a grocery budget of $200, she can buy more than $200 worth of groceries.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Sarah had a small dinner at her house for her three best friends and set four place settings.", "sent_2": "Sarah had a small dinner at her house for her three best friends and set fourteen place settings.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "She was short ten cents, but was able to buy it after finding a dime", "sent_2": "She was short ten cents, but was able to buy it after finding a penny", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If Eric eats two chocolate bars, he will probably get a stomach ache. ", "sent_2": "If Eric eats twenty chocolate bars, he will probably get a stomach ache. ", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "David takes care of his three younger siblings so he spends a lot of time away from his house.", "sent_2": "David takes care of his three younger siblings so he spends a lot of time at his house.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "With a salary of $25,000 a year, he can afford to rent an apartment that costs $2,500 a month.", "sent_2": "With a salary of $25,000 a year, he cannot afford to rent an apartment that costs $2,500 a month.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "There are 839 people in a club with a maximum occupancy of 850, 20 more just arrived, and now we've exceeded the limit by 9 clubgoers.", "sent_2": "There are 839 people in a club with a maximum occupancy of 850, 9 just departed, and now we've exceeded the limit by 20 clubgoers.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "John travelled 2000 kilometers to another country by plane.", "sent_2": "John travelled 20 kilometers to another country by plane.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Because it is the law I had to quarantine for two weeks after I came back from travelling.", "sent_2": "Because it is the law I did not have to quarantine for two weeks after I came back from travelling.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "True"}, {"sent_1": "For Jill's birthday, Sally has brought her a gift.", "sent_2": "For Jill's birthday, she has brought Sally a gift.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Fred decided to say big burp in reaction to  his loud burp in the restaurant", "sent_2": "Fred decided to say excuse me in reaction to  his loud burp in the restaurant", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The house party got so loud that the neighbours called the police", "sent_2": "The house party got so loud that the neighbours called the DJ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Eager to expand his social base, Tim was excited to find out that he knew no one at the party.", "sent_2": "Eager to expand his social base, Tim was excited to find out that several of his friends were at the party.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Bob believes in the tooth fairy. He is very young.", "sent_2": "Bob believes in the tooth fairy. He is very old.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jill is not rational so I would not believe what she tells me about the virus.", "sent_2": "Jill is rational I would believe what she tells me about the virus.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you do not put off paying your bills on time, it is likely that your debts will increase.", "sent_2": "If you do not put off paying your bills on time, it is likely that your debts will decrease.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Elite football clubs have better chances of winning because they have more money for player wages", "sent_2": "Elite football clubs have better chances of winning because they have nicer changing rooms", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "I had a hard time trying to understand what my friend was saying because they had food in their mouth.", "sent_2": "I had a hard time trying to understand what my friend was saying because they didn't have food in their mouth.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Brushing your teeth twice a day will help prevent cavities and tooth decay. ", "sent_2": "Brushing your teeth twice a week will help prevent cavities and tooth decay. ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Laura is not likely to help Karen with her extra work since Karen is not grateful.", "sent_2": "Laura is likely to help Karen with her extra work since Karen is not grateful.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Mary decided to study hard for the exam because her future depends on it", "sent_2": "Mary decided to study hard for exam because her past depends on it", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Lucy applied for a loan in the bank, bank is asking to mortgage her jwellery.", "sent_2": "Lucy applied for a loan in the bank, bank is asking to mortgage her kidney.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "James saw Kyle copying off his test, so he asked him twice to stop, then got the teacher involved.", "sent_2": "James saw Kyle copying off his test, so he asked him twice to continue, then got the teacher involved.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Lucy cheated his husband, she confessed to her husband and wowed to never do it again.", "sent_2": "Lucy cheated his husband, she confessed to her husband and wowed to do it again and again.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Collette was leaving her home for an hour, so she hired a pet sitter.", "sent_2": "Collette was leaving her home for 10 days, so she hired a pet sitter", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If someone gives you a birthday present, they should say Happy Birthday.", "sent_2": "If someone gives you a birthday present, they should say Happy New Year.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since I gave Martha most of my allowance, I can buy my new TV.", "sent_2": "Since I gave Martha only a little bit of my allowance, I can buy my new TV.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Smith is an ambulance driver, So whenever the patient was there in his ambulance he used to drive slowly", "sent_2": "Smith is an ambulance driver, So whenever the patient was there in his ambulance he used to drive faster", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Winters are very cold in Russia so its inhabitants have high heating costs.", "sent_2": "Winters are very cold in Russia so its inhabitants don't have heating costs.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jerry wanted to to buy a computer from many years, he saved for it and bought it on his birthday.", "sent_2": "Jerry wanted to to buy a computer from many years, he prayed hard for it and he was obliged by god.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If someone tutors you for a test, you should score an A.", "sent_2": "If someone tutors you for a test, you should score a D.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Sophia couldn't stand the snow, so she dealt with it by moving in with her aunt in New York.", "sent_2": "Sophia couldn't stand the snow, so she dealt with it by moving in with her aunt in Phoenix.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The mother held hands with each of her twins as they crossed the street together..", "sent_2": "The mother held hands with each of her triplets as they crossed the street together.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Laura is trying to avoid Josh since she owes him a sum of money.", "sent_2": "Laura is trying to avoid Josh since he owes her a sum of money.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "While driving on the road, Christ hears an ambulance siren sound so he speeds up.", "sent_2": "While driving on the road, Christ hears an ambulance siren sound so he slows down.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Lucas is an extremely sloppy eater, so on his first date he thinks it's a good idea to eat out at a restaurant.", "sent_2": "Lucas is an extremely sloppy eater, so on his first date he thinks it's a good idea to go to the movies.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The skills James developed while making jewelry translated well to his later interest in watch repair.", "sent_2": "The skills James developed while making jewelry translated well to his later interest in landscaping.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Gavin went to the mall a few days before Christmas expecting a lot of people, but he was pleasantly surprised to see only a handful of people. ", "sent_2": "Gavin went to the mall a few days before Christmas expecting a lot of people, but he was pleasantly surprised to see only thousands of people. ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "John knew Lisa was single and lonely, so he asked her on a date for Valentine's Day.", "sent_2": "John knew Lisa was in a serious relationship, so he asked her on a date for Valentine's Day.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jonah is trying to lose weight. He is likely to turn down his girlfriend's invite to go to a buffet.", "sent_2": "Jonah is trying to lose weight. He is not likely to turn down his girlfriend's invite to go to a buffet.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "In a bar, I would normally refuse a glass of wine from a stranger.", "sent_2": "In a bar, I would normally refuse a glass of wine from my date.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "As the prices were soaring up, shoppers reduced their purchase quantity.", "sent_2": "As the prices were soaring up, shoppers increased their purchase quantity.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Rachel wants a pet with a long life span, so she gets a hamster instead of a dog.", "sent_2": "Rachel wants a pet with a long life span, so she gets a dog instead of a hamster.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Finch is a fire engine driver, So he used to drive slowly when the siren on", "sent_2": "Finch is a fire engine driver, So he used to drive slowly when the siren off", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Sarah likes to eat junk food so she is likely to consume a bag of chips offered by her friend.", "sent_2": "Sarah likes to eat junk food so she is likely to throw away a bag of chips offered by her friend.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Natalie was embarrassed when her husband yelled at her in the store, so she told all her classmates about the experience.", "sent_2": "Natalie was embarrassed when her husband yelled at her in the store, so she didn't tell all her classmates about the experience.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Xochil was going on her first date with Miguel, so it is more likely he will bring flowers for her.", "sent_2": "Xochil was going on her first date with Miguel, so it is more likely he will bring a ring for her. ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "When Chris went to his grandfather's funeral, everybody looked so sorrowful there.", "sent_2": "When Chris went to his grandfather's funeral, everybody looked so cheerful there.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "A person is more likely to make an uninformed decision than to seek guidance from their boss.", "sent_2": "A person is more likely to seek guidance from their boss than to make an uniformed decision.  ", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Ryan knew Martha was a dog lover, so he bought her high quality dog food.", "sent_2": "Ryan knew Martha was a dog lover, so he bought her high quality cat food.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Eventhough the Signal light is working, it is traffic police responsibility to control the smoke", "sent_2": "Eventhough the Signal light is working, it is traffic police responsibility to control the traffic", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The meal we ordered was cheaper than expected, so we ordered extra meal.", "sent_2": "The meal we ordered was expensive than expected, so we ordered extra meal.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Mary enjoys speed. So she prefers riding a carousel at the theme park.", "sent_2": "Mary enjoys speed. She prefers riding on a gyro-drop at the theme park.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "With school starting next week, there were likely a lot of people at the store buying school supplies.", "sent_2": "With school ending next week, there were likely a lot of people at the store buying school supplies.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "It is normal for someone to spit in the face of a person they have just met.", "sent_2": "It is abnormal for someone to spit in the face of a person they have just met.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The politician claimed he believed in family values so everyone voted for him.", "sent_2": "The politician claimed he believed in family values so his usual voters kept voting for him.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Sue called her mother and and she wasn't home, so she will have to leave a message.", "sent_2": "Sue called her mother and she wasn't home, so she won't have to leave a message.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "His mother will schedule an appointment for her son to take his driver's test after his tenth birthday.", "sent_2": "His mother will schedule an appointment for her son to take his driver's test after his sixteenth birthday.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Victor never brused his teeth, So his teeth were very healthy", "sent_2": "Victor never brused his teeth, So his teeth has 5 cavities", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Whenever Ella needs a haircut, she always goes to her favorite salon in the town.", "sent_2": "Whenever Ella needs a haircut, she always goes to her favorite dentist in the town.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Tim wanted to make his tux more formal so he added a bolo tie.", "sent_2": "Tim wanted to make his tux more formal so he added a bow tie.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Rajesh wanted to buy his girlfriend a ring, he went to a jeweler and purchased a ring.", "sent_2": "Rajesh wanted to buy his girlfriend a ring, he went to a restaurent and purchased a burger.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "causal", "numeracy": "False"}, {"sent_1": " Sonia got up late so  she did 'nt have time for break fast.", "sent_2": "Sonia got up late and so she did 'nt have time for dinner", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since the steak was left cooking on the oven for 3 hours, it was burnt to a crisp. ", "sent_2": "Since the steak was left cooking on the oven for 3 hours, it was not burnt to a crisp. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "My watch is running slow, so I need to add a few minutes to figure out the correct time.", "sent_2": "My watch is running fast, so I need to add a few minutes to figure out the correct time.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "As he has to be at the gym in 5 minutes, he does not have time for a nap.", "sent_2": "As he has to be at the gym in 5 hours, he does not have time for a nap.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "It takes 20 minutes to walk from school to the bus stop and the last bus is 10 minutes after my class ends so I have to leave class 20 minutes early.", "sent_2": "It takes 20 minutes to walk from school to the bus stop and the last bus is 10 minutes after my class ends so I have to leave class 10 minutes early.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "James works six miles from his house, and he normally walks to work. His commute is probably longer than an hour.", "sent_2": "James works six miles from his house, and he normally walks to work. His commute is probably shorter than an thirty minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "John should make sure to zip his pants after he pees", "sent_2": "John should  make sure to zip his pants before he pees.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jack has enrolled for the 4 year engineering course last month and hence he will not graduate at the end of this year.", "sent_2": "Jack has enrolled for the 4 year engineering course last month and hence he will graduate at the end of this year.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The woman had twins, one of whom was born a day after the other.", "sent_2": "The woman had twins, one of whom was born a month after the other.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Robert wanted to watch a movie in the evening show at 7pm,  he left the office 30 minutes before 7pm.", "sent_2": "Robert wanted to watch a movie in the evening show at 7pm,  he left the office 30 minutes before 8pm.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since her daughter's tooth had been loose for a few months, she was not surprised when it fell out today instead of next month.", "sent_2": "Since her daughter's tooth had been loose for a few days, she was not surprised when it fell out today instead of next month.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since it is morning, I will make a pot of coffee.", "sent_2": "Since it is evening, I will make a pot of coffee.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "I like to nap everyday so I have few chances to take an afternoon walk and still get my work done.", "sent_2": "I like to nap everyday so I have many chances to take an afternoon walk and still get my work done.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The hikers wanted to catch the sunrise at the summit, so they started climbing at midnight. ", "sent_2": "The hikers wanted to catch the sunrise at the summit, so they started climbing at noon. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "1 day after it is born, a cat is physically capable of reproducing.", "sent_2": "1 day after it is born, a cat is not physically capable of reproducing.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As they started on the 2 hour journey from home just now, they will not reach the office in ten minutes for the meeting .", "sent_2": "As they started on the 2 hour journey from home just now, they will reach the office in ten minutes for the meeting.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since dinner needs to be ready by 5:00 pm, I should leave for my weekly grocery trip at 4:00 pm.", "sent_2": "Since dinner needs to be ready by 5:00 pm, I should not leave for my weekly grocery trip at 4:00 pm.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Erica usually gets off work at 5 pm. She rarely sees the janitor that comes in for a night shift.", "sent_2": "Erica usually gets off work at 5 pm. She often sees the janitor that comes in for a night shift.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As she has to be at work in 2 minutes she will not have time to talk.", "sent_2": "As she has to be at work in 2 hours she will not have time to talk.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If the meat is frozen, leaving it at room temperature for 5 minutes will be enough for it to thaw.", "sent_2": "If the meat is frozen, leaving it at room temperature for 500 minutes will be enough for it to thaw.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "John needed to buy a cake for his mother's birthday tomorrow so he planned to go to the bakery this afternoon to get one.", "sent_2": "John needed to buy a cake for his mother's birthday tomorrow so he planned to go to the bakery next week to get one.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "It would be more difficult to catch up in her classes if Petunia missed four days of school rather than one. ", "sent_2": "It would be more difficult to catch up in her classes if Petunia missed one day of school rather than four. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As fall is ending, the nights are getting colder. ", "sent_2": "As spring is ending, the nights are getting colder. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since I am scheduled to work 4 hours on Friday, I will have plenty of time to schedule personal appointments for that day.", "sent_2": "Since I am scheduled to work 12 hours on Friday, I will have plenty of time to schedule personal appointments for that day.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As the period for free service of the vehicle was over, Jack had to pay for the last service.", "sent_2": "As the period for free service of the vehicle was over, Jack did not pay for the last service.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Gregory started working at the store when he was eighteen. In two months, he is in basic training.", "sent_2": "Gregory started working at the store when he was eighteen. In two decades, he is in basic training.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since some time is reserved for commercials, the TV program 60 Minutes lasts less than 60 minutes.", "sent_2": "Since some time is reserved for commercials, the TV program 60 Minutes lasts exactly 60 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "I dropped the kids off for the movie at 2PM, so they should be ready for pick-up by 4PM.", "sent_2": "I dropped the kids off for the movie at 4PM, so they should be ready for pick-up at 2PM.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Because I wanted a sweeter banana custard, I waited a day for the bananas to ripen.", "sent_2": "Because I wanted a sweeter banana custard, I waited a month for the bananas to ripen.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you visit the north of Norway during the summer, you'll be able to see the midnight sun.", "sent_2": "If you visit the north of Spain during the summer, you'll be able to see the midnight sun.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Daniel had a train to catch in an hour so he heated his soup in the microwave rather than fire up the wood burning stove.", "sent_2": "Daniel had a a train to catch in an hour so he fired up the wood burning stove rather than heat his soup in the microwave.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Tim's return from China to the U.S. got delayed due to inclement weather causing cancellation of the plane, he will return to work two days later.  ", "sent_2": "Tim's return from China to the U.S. got delayed due to inclement weather causing cancellation of the plane, he will return to work tomorrow.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Peter invited his neighbor Jonathan for dinner, Jonathan arrived on time for dinner.", "sent_2": "Peter invited his neighbor Jonathan for dinner, Jonathan arrived on time for lunch.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Peter got injured in a car accident yesterday, so he is not able to go to work yesterday morning.", "sent_2": "Peter got injured in a car accident yesterday, so he was not able to go to work last Friday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jacob does not have a test until tomorrow so he can study for it today.", "sent_2": "Jacob does not have a test until tomorrow so he can not study for it today.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Because Phil received $30 per hour for working over time, he worked 3 overtime hours so he could buy himself a $70 dollar shirt.", "sent_2": "Because Phil received $30 per hour for working over time, he worked 1 overtime hour so he could buy himself a $70 dollar shirt.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Laura got her paper accepted for publication in March. She decided to start final revision on the paper February of the year.", "sent_2": "Laura got her paper accepted for publication in January. She decided to start final revision on the paper February of the year.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "It's 2 pm and the movie is at 4 pm, so I have time to go buy snacks.", "sent_2": "It's 2 pm and the movie is at 2 pm, so I have time to go buy snacks.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If I want to keep a houseplant healthy, I should place it by a window that gets six hours of sunlight a day.", "sent_2": "If I want to keep a houseplant healthy, I should place it by a window that gets sixty minutes of sunlight a day.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Because the drive was 20 miles long, Beth was able to make it to her destination in under 5 minutes.", "sent_2": "Because the drive was 20 miles long, Beth was able to make it to her destination in under 5 hours.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Amy went outside during November so she decided to wear multiple layers.", "sent_2": "Amy went outside during May so she decided to wear multiple layers.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jon needed to heat his frozen food so he put it in the microwave for 2 minutes.", "sent_2": "Jon needed to heat his frozen food so he put it in the microwave for 10 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "My school bus arrives in 1 minute, I do not have time to walk home 5 minutes for my umbrella.", "sent_2": "My school bus arrives in 15 minutes, I do not have time to walk home 5 minutes for my umbrella.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Jan wanted some time off his job to attend lunch with his girlfriend, so he asked his manager for a break at 12 PM instead of 12 AM.", "sent_2": "Jan wanted some time off his job to attend lunch with his girlfriend, so he asked his manager for a break at 12 AM instead of 12 PM.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Hoping to have a heart to heart with her friend over lunch, Lisa asked her to take a long lunch break instead of a short one.", "sent_2": "Hoping to have a heart to heart with her friend over lunch, Lisa asked her to take a short lunch break instead of a long one.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "A person will not starve to death if they go one day without eating any food.", "sent_2": "A person will starve to death if they go one day without eating any food.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Paula's school is within a ten minute walk. So she decided to ride a bike.", "sent_2": "Paula's school is within a ten minute walk. So she decided to get on a plane.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Someone who has 1000$ in the bank and gets 4% interest per year, will have more than 1030$ at the end of the first year", "sent_2": "Someone who has 1000$ in the bank and gets 3% interest per year, will have more than 1030$ at the end of the first year", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you want to get Halloween candy on sale you should go one day after Halloween.", "sent_2": "If you want to get Halloween candy on sale you should go one year after Halloween.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The storm is supposed to hit in 50 minutes and I love running in the rain so I'll go on a run in 50 minutes.", "sent_2": "The storm is supposed to hit in 50 minutes and I love running in the rain so I'll go on a run in 5 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If a person in the Europe is having dinner around 8 pm GMT, most people in Australia are asleep", "sent_2": "If a person on the west coast of USA is having dinner around 8 pm, most people in Australia are asleep", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "In the winter time in Canada, I love playing pond hockey.", "sent_2": "In the summer time in Canada, I love playing pond hockey.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you want to make a good batch of popcorn, you should microwave it until there is one second between pops.", "sent_2": "If you want to make a good batch of popcorn, you should microwave it until there is one minute between pops.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "For ice skaters training for the Olympics, an hour a day of training is not enough, but six hours a day might be.", "sent_2": "For ice skaters training for the Olympics, an hour a day of training is enough, and six hours a day is excessive.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you're driving right behind someone who suddenly brakes, you might only have a minute or two to react before crashing!", "sent_2": "If you're driving right behind someone who suddenly brakes, you might only have a second or two react before crashing!", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since my last exam is today, I booked a flight home from school that departs tomorrow.", "sent_2": "Since my last exam is today, I booked a flight home from school that departed yesterday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Frida wanted to avoid crowds at the beach, so she went there at  12 am.", "sent_2": "Frida wanted to avoid crowds at the beach, so she went there at 12 pm.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": " If you go to the grocery store and buy flour with the intention of turning it into a cake, you will have to wait about 180 minutes for it to be ready.", "sent_2": " If you go to the grocery store and buy flour with the intention of turning it into a cake, you will have to wait about 18 minutes for it to be ready.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since my doctor's appointment is at noon and it takes twenty minutes to get there, I should leave by 11:45 am.", "sent_2": "Since my doctor's appointment is at noon and it takes ten minutes to get there, I should leave by 11:45 am.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since I don't have to work on Saturday, I can plan to go out of town for the day.", "sent_2": "Since I have to work on Saturday, I can't plan to go out of town for the day.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Hayden was 17 years old, so he knew it was time to start looking into what colleges he is interested in. ", "sent_2": "Hayden was 17 months old, so he knew it was time to start looking into what colleges he is interested in. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The criminal had only nine minutes to get away after the alarm was sounded, so he made sure the get-away car was just across the street", "sent_2": "The criminal had only nine minutes to get away after the alarm was sounded, so he made sure the get-away car was far from the scene.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you feel a cramp in your legs, you should stretch your legs to relieve some of the tension.", "sent_2": "If you feel a cramp in your legs, you should bend your legs to relieve some of the tension.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Today is January 21, and Valentine's Day is on February 14, so I have plenty of time to search for and land a date for the day of lovers.", "sent_2": "Today is January 21, and Valentine's Day is on February 14, so I don't have enough time to search for and land a date for the day of lovers.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The movie does not start for 3 hours so Tate has time to eat dinner first.", "sent_2": "The movie does not start for 3 hours so Tate does not have time to eat dinner first.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Laura has been trying to memorize a Beethoven Piano Sonata. It took her five weeks.", "sent_2": "Laura has been trying to memorize a Beethoven Piano Sonata. It took her one hour.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since he'd be driving in the middle of the day, John was sure to take his sunglasses.", "sent_2": "Since he'd be driving in the middle of the night, John was sure to take his sunglasses.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}]