[{"sent_1": "Having to go out in two minutes, Carl should wear slip-on shoes instead of sneakers.", "sent_2": "Having to go out in two minutes, Carl should wear sneakers instead of slip-on shoes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since Sally is very tired right now she will clean the kitchen in the morning instead of tonight.", "sent_2": "Since Sally is very tired right now she will clean the kitchen tonight instead of in the morning.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Naomi has a short attention span, so she would have an easier time watching a 1 hour movie instead of a 3 hour movie.", "sent_2": "Naomi has a short attention span, so she would have an easier time watching a 3 hour movie instead of a 1 hour movie.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Having to teach a night class in thirty minutes, he should make a frozen meal instead of a three-course dinner.", "sent_2": "Having to teach a night class in thirty minutes, he should make a three-course dinner instead of a frozen meal.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Barry wants to see a movie with a friend in three days time. He should have told his friend about it four days ago rather than today to give them a week's notice", "sent_2": "Barry wants to see a movie with a friend in three days time. He should tell his friend about it today rather than four days ago to give them a week's notice", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If the movie comes out tomorrow, he should make plans to watch it today rather than 2 days from now.", "sent_2": "If the movie comes out tomorrow, he should make plans to watch it 2 days from now rather than today.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is easier to run one mile in ten minutes, than it is to run two miles in five minutes.", "sent_2": "It is easier to run two miles in five minutes than it is to run one mile in ten minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The 600 pound weight was easier to lift than the 200 pound weight.", "sent_2": "The 200 pound weight was easier to lift than the 600 pound weight.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A football player will have more difficulty throwing a football with two broken arms than with no broken arms.", "sent_2": "A football player will not have more difficulty throwing a football with two broken arms than with no broken arms.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A four bedroom house is more suitable for a family of six than a two bedroom house.", "sent_2": "A two bedroom house is more suitable for a family of six than a four bedroom house.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is more likely that your bread will rise with 2 tablespoons of yeast in it than with sugar.", "sent_2": "It is more likely that your bread will rise with 2 tablespoons sugar in it than with yeast.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "June stayed home from school because she was sick. When her temperature hit 102.1, her parents knew they had to rush her to the hospital. ", "sent_2": "June stayed home from school because she was sick. When her temperature hit 98.6, her parents knew they had to rush her to the hospital. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "it is easier to run 100 feet than 500 feet", "sent_2": "it is easier to run 500 feet than 100 feet", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since Erica is afraid of heights, she decided to drive a car to her aunt’s house three states away rather than fly on an airplane. ", "sent_2": "Since Erica is afraid of heights, she decided to fly on an airplane to her aunt’s house three states away rather than drive a car. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If a person drinks a litre of vodka with 37.5% alcohol, then the person will have drank more than someone who had 5 litres of beer with 5% alcohol", "sent_2": "If a person drinks a litre of vodka with 37.5% alcohol, then the person will have drank more than someone who had 7 litres of beer with 5,6% alcohol", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is more likely to achieve fluffier pancakes with one extra teaspoon of baking powder rather than none.", "sent_2": "It is more likely to achieve fluffier pancakes with no extra teaspoons of baking powder rather than one.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is more likely that the vegetables will grow if you use a packet full of seeds instead of just one seed.", "sent_2": "It is more likely that the vegetables will grow if you use one seed instead of a packet full of seeds.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is easier for one person to eat an entire small pizza than an entire large pizza themselves. ", "sent_2": "It is easier for one person to eat an entire large pizza than an entire small pizza themselves. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is easier to move around more freely while using your cell phone if it is charging with a six foot cord rather than a one foot cord. ", "sent_2": "It is easier to move around more freely while using your cell phone if it is charging with a one foot cord rather than a six foot cord. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It's easier to pick up a spatula with one hand than it is to pick up a frying pan.", "sent_2": "It's easier to pick up a frying pan with one hand than it is to pick up a spatula.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is faster for 300 builders to construct a building than it is for 100 builders. ", "sent_2": "It is faster for 100 builders to construct a building than it is for 300 builders. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If you lost your mitten in a snowbank, a proper alternative would be a plastic grocery bag rather than an oven mitt.", "sent_2": "If you lost your mitten in a snowbank, a proper alternative would be an oven mitt rather than a plastic grocery bag.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If the store doesn’t have your exact shoe size, it is generally better to buy the next size up rather than the next size down. ", "sent_2": "If the store doesn’t have your exact shoe size, it is generally better to buy the next size down rather than the next size up. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "When it's raining outside, it's a good idea to walk to work instead of driving.", "sent_2": "When it's raining outside, it's a good idea to drive to work instead of walking.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Since his roommate is taking a test, he should make breakfast using the stove instead of the blender.", "sent_2": "Since his roommate is taking a test, he should make breakfast using the blender instead of the stove.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is easier to eat cereal with a spoon than a fork", "sent_2": "It is easier to eat cereal with a fork than a spoon", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is more convenient for a person to wear a shirt than to wear a pillow.", "sent_2": "It is more convenient for a person to wear a pillow than to wear a shirt.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The iron bar was likely to be harder than the diamond bar.", "sent_2": "The diamond bar was likely to be harder than the iron bar.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "A needle is more suitable for sewing than a stapler.", "sent_2": "A needle is more suitable for sewing than a stapler.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "While the kids are sleeping I mix the cookie dough by hand", "sent_2": "While the kids are sleeping I mix cookie dough with the loud electric mixer", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "For a better flavor, it is better to put almond in ice cream than soy sauce.", "sent_2": "For a better flavor, it is better to put soy sauce in ice cream than almond.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The heating was broken so to stay warm inside she thought it'd be better to wear a blanket than a towel.", "sent_2": "The heating was broken so to stay warm inside she thought it'd be better to wear a towel than a blanket .", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It's more convenient to use a cloth than a hammer for cleaning the windows.", "sent_2": "It's less convenient to use a cloth than a hammer for cleaning the windows.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "When you try to scrape pieces of gum under the desk, it would be better to use a coin than a comb.", "sent_2": "When you try to scrape pieces of gum under the desk, it would be better to use a comb than a coin.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Picking a scab off a wound will make the wound heal faster than not picking the scab off.", "sent_2": "Picking a scab off a wound will make the wound heal slower than not picking the scab off.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It's easier to see through a chain link fence than a fence made out of bricks with no gaps in them.", "sent_2": "It's harder to see through a chain link fence than a fence made out of bricks with no gaps in them.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The woman found that the steak knife could cut through butter as easily as it cut through steak.", "sent_2": "The woman found that the butter knife could cut through steak as easily as it cut through butter.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It's easier to compute a multi-digit multiplication problem with a calculator than by working it out by hand. ", "sent_2": "It's harder to compute a multi-digit multiplication problem with a calculator than by working it out by hand. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is better to have white wine with fish than red wine", "sent_2": "It is better to have red wine with fish than white wine", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "You will usually reach your destination faster if you take a bus instead of a car.", "sent_2": "You will usually reach your destination faster if you take a car instead of a bus.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If you need to get gum out of your hair, oil would probably be more effective than vinegar.", "sent_2": "If you need to get gum out of your hair, vinegar would probably be more effective than oil.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If you are missing a flyswatter to kill a fly, it would be better to use a newspaper then a roll of paper towel.", "sent_2": "If you are missing a flyswatter to kill a fly, it would be better to use a roll of paper towel than a newspaper.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Jessica loves fruit but despises vegetables. Therefore, she is more likely to eat banana bread than zucchini bread. ", "sent_2": "Jessica loves fruit but despises vegetables. Therefore, she is more likely to eat zucchini bread than banana bread. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If you are out of soap, it is better to use hand sanitizer than water. ", "sent_2": "If you are out of soap, it is better to use water than hand sanitizer. ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "A steel rod might be more suitable than a wooden spoon for penetrating a brick wall.", "sent_2": "A steel rod might be less suitable than a wooden spoon for penetrating a brick wall.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The family's drier is broken so it's better to wait for a cold sunny day rather than a warm rainy day to wash their clothes.", "sent_2": "The family's drier is broken so it's better to wait for a warm rainy day rather than a cold sunny day to wash their clothes.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "When looking for a quiet place to read, it's better to go to the park than a rock concert", "sent_2": "When looking for a quiet place to read, it's better to go to a rock concert than the park", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "To clean carpet, it is much easier to use a vacuum than a broom", "sent_2": "To clean carpet, it is much easier to use a broom than a vacuum.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "An axe is more suitable for cutting down a tree than a chisel.", "sent_2": "An axe is less suitable for cutting down a tree than a chisel.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It's more convenient to use a rag rather than a strap, as a dusting cloth.", "sent_2": "It's less convenient to use a rag rather than a strap, as a dusting cloth.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "On a cold night, it's better to wear a jacket than a tank top", "sent_2": "On a hot day, it's better to wear a jacket than a tank top", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is more convenient to swim naked than swim in a dress.", "sent_2": "It is harder to swim naked than swim in a dress.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It's more convenient to take a train to work than to walk to work", "sent_2": "It's less convenient to take a train to work than to walk to work", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "To travel to Iceland from California, it is faster to fly on a plane rather than take a boat.", "sent_2": "To travel to Iceland from California, it is slower to fly on a plane rather than take a boat.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Cats are more likely to feel satisfied after eating meat rather than vegetables. ", "sent_2": "Cats are more likely to feel satisfied after eating vegetables rather than meat . ", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is easier to dig up a buried treasure using a spoon than it would be with a shovel.", "sent_2": "It is not easier to dig up a buried treasure using a spoon than it would be with a shovel.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The sun was getting in Jeff's eyes so he put on his cap forward rather than backward.", "sent_2": "The sun was getting in Jeff's eyes so he put on his cap backward rather than forward.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is better to store books on a shelf instead of in a drawer.", "sent_2": "It is better to store books in a drawer instead of on a shelf.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "A steel bottle might be more suitable than a strainer for holding liquid.", "sent_2": "A steel bottle might be less suitable than a strainer for holding liquid.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "My brother needs a kidney transplant and a heart transplant, so I offered to donate my heart.", "sent_2": "My brother needs a kidney transplant and a heart transplant, so I offered to donate my kidney.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is less to painful to have a hug than surgery", "sent_2": "It is less to painful to have surgery than a hug", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Harry wants a pet that he can easily pick up and snuggle with, so he should buy a Shih Tzu dog instead of a German Shepard dog.", "sent_2": "Harry wants a pet that he can easily pick up and snuggle with, so he should buy a German Shepard dog instead of a Shih Tzu dog.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If your car does not start, it may be better to take a taxi rather than to run to work.", "sent_2": "If your car does not start, it may be better to run to work rather than to take a taxi.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is easier to walk home from the store if you just bought a few things.", "sent_2": "It is harder to walk home from the store if you just bought a few things.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Driving is safer when the roads are covered in snow than when they are not.", "sent_2": "Driving is more dangerous when the roads are covered in snow than when they are not.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If you have lost your oven mitt, it would be much more useful to use a dry towel than it would be to use a football to remove your cookies from the oven.", "sent_2": "If you have lost your oven mitt, it would be much more useful to use a football than it would be to use a dry towel to remove your cookies from the oven.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "John is going bald, so he uses more shampoo than Steve.", "sent_2": "John is going bald, so he uses less shampoo than Steve.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "When draining pasta, a colander is better than a cheesecloth.", "sent_2": "When draining pasta, cheesecloth is better than a colander.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "In order to make our part in saving the planet, it is recommend to write our notes on a LCD reusable blackboard rather than sheets of paper.", "sent_2": "In order to make our part in saving the planet, it is recommend to write our notes on sheets of paper rather than a LCD reusable blackboard.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "To play baseball without a baseball, a tennis ball is a better substitute than a basketball.", "sent_2": "To play baseball without a baseball, a basketball is a better substitute than a tennis ball.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "To keep make food last longer, keep the refrigerator partly open rather than fully closed. ", "sent_2": "To keep make food last longer, keep the refrigerator fully closed rather than partly open. ", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If you do not have chopsticks, it would be easier to use a fork to eat chow mein than a spoon.", "sent_2": "If you do not have chopsticks, it would be easier to use a spoon to eat chow mein than a fork.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is much less messy to accidentally put a cracker in a DVD tray than a CD with music on it.", "sent_2": "It is much less messy to accidentally put a CD with music on it in a DVD tray than a cracker.", "label_1": "False", "label_2": "True", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "To keep documents safer in case of flood, it's better to put them in a plastic box instead of a cardboard box.", "sent_2": "To keep documents safer in case of flood, it's better to put them in a cardboard box instead of a plastic box.", "label_1": "True", "label_2": "False", "domain": "physical", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Emily with 6 years of experience at her role is harder to replace when compared to Susan who started working last month in the same department.", "sent_2": "Emily with 6 years of experience at her role is easier to replace when compared to Susan who started working last month in the same department.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Case spent $5000 on his new suit and Colt spent $150 on his. Thus, Colt's suit is more likely to wear out first. ", "sent_2": "Case spent $5000 on his new suit and Colt spent $150 on his. Thus, Case's suit is more likely to wear out first.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "John can run 10K in one hour while Tammy can run a marathon in three hours. Tammy is faster.", "sent_2": "John can run 10K in one hour while Tammy can run a marathon in three hours. John is faster.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": " Someone caring for a newborn is less likely to have a good night of sleep compared with someone who isn't caring for one.", "sent_2": " Someone caring for a newborn is more likely to have a good night of sleep compared with someone who isn't caring for one.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Jane was born without legs but Lina was born with two legs, so it is more likely that Jane would be an activist for people with disabilities than Lina.", "sent_2": "Jane was born without legs but Lina was born with two legs, so it is more likely that Lina would be an activist for people with disabilities than Jane.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Dick and Harry work two adjacent plots of land of similar size. While Dick takes care of the plants and weeds them and waters them, Harry is never around to care for his plants, so Dick will harvest more grain from his plot of land.", "sent_2": "Dick and Harry work two adjacent plots of land of similar size. While Dick takes care of the plants and weeds them and waters them, Harry is never around to care for his plants, so Dick will harvest fewer grains from his plot of land.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Sandra stays home and looks after her four kids, so people would understand if she doesn't wear makeup.", "sent_2": "Sandra stays home and looks after her four kids, so people wouldn't understand if she didn't wear makeup.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Alex has been living in her apartment for 3 years, while Ruby has only lived there 3 months. Of the two, Alex is more likely to be able to predict accurate electric costs for the coming months.", "sent_2": "Alex has been living in her apartment for 3 years, while Ruby has only lived there 3 months. Of the two, Ruby is more likely to be able to predict accurate electric costs for the coming months.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A 13 year old is more likely to want a social media account rather than a 3 year old.", "sent_2": "A 3 year old is more likely to want a social media account rather than a 13 year old.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Bill's grass is 2 feet tall, and Tom's grass is freshly cut. Both Bill and Tom ask John to borrow John's lawn mower. John thinks it makes sense to let Bill borrow the mower first.", "sent_2": "Bill's grass is 2 feet tall, and Tom's grass is freshly cut. Both Bill and Tom ask John to borrow John's lawn mower. John thinks it makes sense to let Tom borrow the mower first.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Even if the late fee is only 10 dollars, it is better to pay nothing in late fees than a ten dollar late fee. ", "sent_2": "Even if the late fee is only 10 dollars it is better to pay 10 dollars in late fees than nothing.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Jeff has 200 friends that he talks to regularly, while Matt only has 2.  Jeff is more likely to be at a party on a weeknight rather than Matt.", "sent_2": "Jeff has 200 friends that he talks to regularly, while Matt only has 2.  Matt is more likely to be at a party on a weeknight rather than Matt.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Sally's sister is ten years younger than her so it is more likely Sally will have children first.", "sent_2": "Sally's sister is ten years younger than her so it is less likely Sally will have children first.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Sarah usually stays up late on Friday nights, where as her roommate Julie usually goes to bed at nine pm. Saturday morning Sarah sleeps in and Julie is up early.", "sent_2": "Sarah usually stays up late on Friday nights, where as her roommate Julie usually goes to bed at nine pm. Saturday morning Julie sleeps in and Sarah is up early.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Andrew and Jack will be playing football on opposing teams. Andrew will more likely pass the ball to his teammate rather than to Jack.", "sent_2": "Andrew and Jack will be playing football on opposing teams. Andrew will more likely pass the ball to Jack rather than to his teammate.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Jenny is overweight, so she is more likely to go to a fast food joint than the gym.", "sent_2": "Jenny is overweight, so she is more likely to go to the the gym than a fast food joint.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Don's son is a cashier at Walmart. Hank's son is a doctor. Therefore, Hank's son is more likely to have gone to college.", "sent_2": "Don's son is a cashier at Walmart. Hank's son is a doctor. Therefore, Hank's son is less likely to have gone to college. ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Alex is a gardener and Jack is a plumber. When Jack's toilet broke he asked Alex to fix it for him.", "sent_2": "Alex is a gardener and Jack is a plumber. When Jack's toilet broke he fixed it himself. ", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Nancy is a teacher and Sally is a scientist so Nancy is more likely to work with children.", "sent_2": "Nancy is a teacher and Sally is a scientist so Sally is more likely to work with children.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Reggie and Timmy are neighbors who live in very large mansions. Reggie works as a house cleaner, while Timmy works as a coal miner. Reggie's house is more likely to be clean.", "sent_2": "Reggie and Timmy are neighbors who live in very large mansions. Reggie works as a house cleaner, while Timmy works as a coal miner. Timmy's house is more likely to be clean.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Ted is a painter and Rick is a floor guy. Rick is more likely to get back problems than Ted.", "sent_2": "Ted is a painter and Rick is a floor guy. Rick is less likely to get back problems than Ted.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "As I was too short to reach the top shelf at the grocery store, I asked the clerk who went out their way to not satisfy my needs for asking for help making me feel great.", "sent_2": "As I was too short to reach the top shelf at the grocery store, I asked the clerk who went out their way to satisfy my needs for asking for help making me feel great.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Medical facilities are more important than infrastructural facilities for the general health of the people.", "sent_2": " Infrastructural facilities are more important than Medical facilities for the general health of the people.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Sam is a software programmer while Howard works in marketing.  Sam is much more likely to wear casual clothing like shirts with cartoons on them while on the job.", "sent_2": "Sam is a software programmer while Howard works in marketing.  Howard is much more likely to wear casual clothing like shirts with cartoons on them while on the job.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Mark checked his boots for scorpions while Jim just shoved his feet in, so Mark is less likely to get stung.", "sent_2": "Mark checked his boots for scorpions while Jim just shoved his feet in, so Jim is less likely to get stung.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Divorced Sam married Joan. Joan is less likely to be more knowledgeable in marriage laws than Sam.", "sent_2": "Sam married a divorcee named Joan. Joan is less likely to be more knowledgeable in marriage laws than Sam.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Juan cut Joe's neck with a knife during surgery, but Maria cut Eliza's neck with a knife because Eliza flirted with Maria's husband. People were shocked by Maria's action.", "sent_2": "Juan cut Joe's neck with a knife during surgery, but Maria cut Eliza's neck with a knife because Eliza flirted with Maria's husband. People were shocked by Juan's action.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Becky is allergic to legumes, while Nancy is allergic to tree nuts. Nancy is more likely than Becky to eat peanuts.", "sent_2": "Becky is allergic to legumes, while Nancy is allergic to tree nuts. Becky is more likely than Nancy to eat peanuts.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Jane is a British fashion designer who loves input from exotic parts of the world. She's likely to be interested in fashion ideas from Madagascar.", "sent_2": "Jane is a British fashion designer who loves input from exotic parts of the world. She's likely to be interested in fashion ideas from her neighbor.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "People prefers answering the phone than listening to voice mail for spam calls.", "sent_2": "People prefers listening to voice mail than answering the phone for spam calls.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Jake and Val both work at the pet store. Since Jake is allergic to dogs, Val is more likely to seek a position as a groomer.", "sent_2": "Jake and Val both work at the pet store. Since Jake is allergic to dogs, Jake is more likely to seek a position as a groomer.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "If Sean has a girlfriend and John is single, John is more likely to work longer hours on Valentine's day than Sean.", "sent_2": "If Sean has a girlfriend and John is single, Sean is more likely to work longer hours on Valentine's day than John.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "A cat burglar is less likely to be caught by police than a bank robber.", "sent_2": "A bank robber is less likely to be caught by police than a cat burglar.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "A person who works from home is more likely to wear pajamas while working than a person who works in an office.", "sent_2": "A person who works in an office is more likely to wear pajamas while working than a person who works from home.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Her water broke so they took their car instead of waiting for the bus.", "sent_2": "Her water broke so they waited for the bus instead of taking their car.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Sally is an elementary school teacher, while Betty works at a grocery store. Therefore, Sally is more likely to have time off in summer.", "sent_2": "Sally is an elementary school teacher, while Betty works at a grocery store. Therefore, Betty is more likely to have time off in summer.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Anna married her high school sweetheart, and Jenna met her husband at work. Anna probably met her spouse more recently.", "sent_2": "Anna married her high school sweetheart, and Jenna met her husband at work. Jenna probably met her spouse more recently.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "As she contemplates going vegan, Beth looks for inspiration by deciding to visit the animal sanctuary rather than the steakhouse.", "sent_2": "As she contemplates going vegan, Beth looks for inspiration by deciding to visit the steakhouse rather than the animal sanctuary.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Brittany and Michael have children in daycare.  Michael works later in the evening. Therefore, Brittany is less likely to pick up the children from daycare.", "sent_2": "Brittany and Michael have children in daycare.  Michael works later in the evening. Therefore, Brittany is more likely to pick up the children from daycare.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Brad runs the red light, since he needs to visit his mother in a nursing home. Others will be more sympathetic if he expresses the reason.", "sent_2": "Brad runs the red light, since he needs to visit his mother in a nursing home. Others will be more sympathetic if he stays quiet.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Both Pam and Brad are co-workers. Pam needs to spend time with his aging aunt, while Brad lives alone. Therefore, Pam is more likely to ask for a raise.", "sent_2": "Both Pam and Brad are co-workers. Pam needs to spend time with his aging aunt, while Brad lives alone. Therefore, Brad is more likely to ask for a raise.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The neighbors are more interested in asking 16-year-old Alexis to babysit than they are to ask 10-year-old David to babysit.", "sent_2": "The neighbors are more interested in asking 10-year-old David to babysit than they are to ask 16-year-old Alexis to babysit.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Edie takes acrobatic lessons, while Khloe takes dance lessons; Edie is more likely to be able to do a cartwheel than Khloe.", "sent_2": "Edie takes acrobatic lessons, while Khloe takes dance lessons; Khloe is more likely to be able to do a cartwheel than Edie.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Susan is coming over to Sally's baby shower so she is bringing diapers", "sent_2": "Susan is coming over to Sally's baby shower so Sally is offering her diapers", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The intern stole some paper but Alex stole data. That is why the boss is most angry at Alex.", "sent_2": "The intern stole some paper but Alex stole data. That is why the boss is most angry at the intern.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Jenny's children are more likely to get sick than Penny's children because Jenny is an antivaxxer while Penny respects the immunization schedule.", "sent_2": "Penny's children are more likely to get sick than Jenny's children because Jenny is an antivaxxer while Penny respects the immunization schedule.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Al is a painter and Sam is an accountant. Sam is more likely to work at a desk.", "sent_2": "Al is a painter and Sam is an accountant. Al is more likely to work at a desk.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Anna drives to work every day while Bry works from home, therefore Anna is more likely to experience a flat tire.", "sent_2": "Anna drives to work every day while Bry works from home, therefore Anna is less likely to experience a flat tire.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Johannes is investor so he is more likely to save his money than regular man", "sent_2": "Johannes is investor so he is more likely to spend his money than regular man", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Maxwell and Myles take turns driving on a long trip. Maxwell drinks coffee while Myles does not. Therefore, Myles is more likely to fall asleep while driving.", "sent_2": "Maxwell and Myles take turns driving on a long trip. Maxwell drinks coffee while Myles does not. Therefore, Maxwell is more likely to fall asleep while driving.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Moira has a lot of serious allergies, but Sadie doesn't have any. Therefore, Sadie is more likely to eat out at restaurants than Moira.", "sent_2": "Moira has a lot of serious allergies, but Sadie doesn't have any. Therefore, Sadie is less likely to eat out at restaurants than Moira.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Ian is a professor while Jim is a businessman. Ian is likely to travel abroad than Jim.", "sent_2": "Ian is a professor while Jim is a businessman. Ian is less likely to travel abroad than Jim.", "label_1": "False", "label_2": "True", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Nicole is a track star while Yolanda is a receptionist.  Nicole is much more likely than Yolanda to need to purchase new shoes often.", "sent_2": "Nicole is a track star while Yolanda is a receptionist.  Yolanda is much more likely than Nicole to need to purchase new shoes often.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Tommy is a pescatarian and Otto is a vegetarian. Therefore Tommy is more likely to eat fish.", "sent_2": "Tommy is a pescatarian and Otto is a vegetarian. Therefore Otto is more likely to eat fish.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Jonah is an intern at an office where Hilda is a supervisor. Jonah will be expected to get coffee for Hilda.", "sent_2": "Jonah is an intern at an office where Hilda is a supervisor. Hilda will be expected to get coffee for Jonah.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "It is more traditional to eat rice with chopsticks than a spoon", "sent_2": "It is more traditional to eat rice with a spoon than chopsticks", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Mike is a vegan, but his wife Lisa is not. Therefore, Lisa is more likely to order meringue for dessert. ", "sent_2": "Mike is a vegan, but his wife Lisa is not. Therefore, Mike is more likely to order meringue for dessert. ", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "When the calculus teacher fell ill, the principal asked the physics teacher to fill in, not the art teacher.", "sent_2": "When the calculus teacher fell ill, the principal asked the art teacher to fill in, not the physics teacher.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Matthew has played video games for years, whereas Dick just received his first ever game console. People will expect Matthew to be more skilled at gaming.", "sent_2": "Matthew has played video games for years, whereas Dick just received his first ever game console. People will expect Dick to be more skilled at gaming.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Tim wanted to go to the bar so he thought it would be better to order an Uber than drive there.", "sent_2": "Tim wanted to go to the bar so he thought it would be better to drive there than order an Uber.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Ryan is a firefighter; he is more relevant at an explosion site than at a bank robbery.", "sent_2": "Ryan is a firefighter; he is less relevant at an explosion site than at a bank robbery.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Amy just lost her job at the factory and Cindy just won the lottery. Cindy is more likely to book a vacation around the world.", "sent_2": "Amy just lost her job at the factory and Cindy just won the lottery. Amy is more likely to book a vacation around the world.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Kevin is a receptionist and Andrew is a waiter so Andrew's work requires more body work", "sent_2": "Kevin is a receptionist and Andrew is a waiter so Kevin's work requires more body work", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Mary is interested in gardening. Her husband Tom enjoys mowing the grass. Tom and Mary are unlikely to hire a lawn maintenance company.", "sent_2": "Mary is interested in gardening. Her husband Tom enjoys mowing the grass. Tom and Mary are likely to hire a lawn maintenance company.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Sandy is a banker so that she is more likely to have free time at night than in the day time.", "sent_2": "Sandy is a banker so that she is less likely to have free time at night than in the day time.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Sally works at a daycare and Jane works as a law firm, so Sally is more likely to be good with children.", "sent_2": "Sally works at a daycare and Jane works as a law firm, so Sally is less likely to be good with children.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Sam went to a seminary school while Paul is a bus driver. Sam is more like to recite the book of Job by heart than Paul.", "sent_2": "Sam went to a seminary school while Paul is a bus driver. Paul is more like to recite the book of Job by heart than Sam.", "label_1": "True", "label_2": "False", "domain": "social", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Amber has a class in a few minutes, she would prefer to eat a quick lunch before going to class instead of going grocery shopping.", "sent_2": "Amber has a class in a few minutes she would prefer to go grocery shopping before going to class instead of eating a quick lunch. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "As I have to be at work in one hour, I will do the dishes now and go to the laundromat later.", "sent_2": "As I have to be at work in one hour, I will go to the laundromat now and do the dishes later.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If John wants to see the sunset, he should start watching at 7:00 pm instead of 5:00 pm.", "sent_2": "If John wants to see the sunset, he should start watching at 5:00 pm instead of 7:00 pm.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A person born 8 years ago has not lived longer than a person born 80 months ago.", "sent_2": "A person born 8 years ago has lived longer than a person born 80 months ago.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Sarah starts college in 3 months, so she should choose her classes in the next month rather than the next year.", "sent_2": "Sarah starts college in 3 months, so she should choose her classes in the next year rather than the next month.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "John has an important job interview on Monday morning, so he would rather go partying on Saturday night than on Sunday night.", "sent_2": "John has an important job interview on Monday morning, so he would rather go partying on Saturday night than on Sunday night.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "His exam started in twenty minutes, so he decided he'd take an hour-long nap afterward instead of before.", "sent_2": "His exam started in twenty minutes, so he decided he'd take an hour-long nap before it instead of afterward.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is better for Bert’s health if he quits smoking after one year than after five. ", "sent_2": "It is better for Bert’s health if he quits smoking after five years than after one. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A son visiting his parents after 2 years is likely to carry special gifts for them than a son who vist them every day.", "sent_2": "A son visiting his parents every day is likely to carry special gifts for them than a son who vist them after 2 years.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is safer to drink milk after it's been refrigerated for 1 week rather than 20 weeks.", "sent_2": "It is safer to drink milk after it's been refrigerated for 20 weeks rather than 1 week.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Ruby was seven months pregnant in October, so she expected to be even bigger in November, but smaller by January.", "sent_2": "Ruby was four months pregnant in October, so she expected to be even bigger in November, but smaller by January.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Work done at 5 hours per day for 10 days is same as work done at 10 hours per day for 5 days.   ", "sent_2": "Work done at 5 hours per day for 10 days is not same as work done at 10 hours per day for 5 days.   ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Because the museum's security is worse at night, Tim should rob the museum at 3:00 am instead of 3:00 pm.", "sent_2": "Because the museum's security is worse at night, Tim should rob the museum at 3:00 pm instead of 3:00 am.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Maggie in the US sent a letter to her boyfriend living in Europe. She expects it to arrive today rather than next month.", "sent_2": "Maggie in the US sent a letter to her boyfriend living in Europe. She expects it to arrive next month rather than today.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The immunity of an adult of age 21 years is generally better than a child of age 10 years.", "sent_2": " The immunity of a child of age 10 years is generally better than an adult of age 21 years.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since my friend's birthday is today, I should wish her a happy birthday today rather than yesterday.", "sent_2": "Since my friend's birthday is today, I should have wished her a happy birthday yesterday rather than now.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Amy wanted to make a pizza for dinner so she put the pizza in the oven for 2 hours rather than 15 minutes.", "sent_2": "Amy wanted to make a pizza for dinner so she put the pizza in the oven for 15 minutes rather than 2 hours.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It makes more sense to eat breakfast before bed time than it does to eat dinner.", "sent_2": "It makes more sense to eat dinner before bed time than it does to eat breakfast.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Peter and Paul work at night in alternate days, meaning Peter works one night, next night Paul and so on, last Monday Peter was at work, so this Monday Paul will be at work and not Peter.", "sent_2": "Peter and Paul work at night in alternate days, meaning Peter works one night, next night Paul and so on, last Monday Peter was at work, so this Monday Peter will be at work and not Peter.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since Joe would only drink coffee that he'd heated in the microwave for at least a minute, he decided to heat it for 65 seconds instead of 650 seconds.", "sent_2": "Since Joe would only drink coffee that he'd heated in the microwave for at least a minute, he decided to heat it for 650 seconds instead of 65 seconds.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "James' bus comes at 6:30 AM and he woke up at 6:28 AM, so he'll skip breakfast instead of making pancakes.", "sent_2": "James' bus comes at 6:30 AM and he woke up at 4:30 AM, so he'll make pancakes instead of skipping breakfast.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "My arms hurt after reading for too many hours this heavy book. Next time I'll buy a single volume instead of another omnibus.", "sent_2": "My arms hurt after reading for too many hours this heavy book. Next time I'll buy another omnibus instead of a single volume.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "John had to get up early Saturday, so he went to bed early on Friday instead of staying up late.", "sent_2": "John had to get up early Saturday, so he went to bed extra late on Friday instead of turning in early", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The movie was starting in ten minutes, so the couple decided to have dinner afterward instead of before the movie.", "sent_2": "The movie was starting in ten minutes, so the couple decided to have dinner before the movie instead of afterward", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A shirt bought yesterday is in much better shape than one bought fifty years ago.", "sent_2": "A shirt bought fifty years ago is in much better shape than one bought yesterday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If Granny starts making the tea now, you can have hot tea sooner than ice tea.", "sent_2": "If Granny starts making the tea now, you can have ice tea sooner than hot tea.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "I brought a lot of work to do tonight, so I should make sure dinner takes 30 minutes rather than 3 hours.", "sent_2": "I brought a lot of work to do tonight, so I should make sure dinner takes 3 hours rather than 30 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Daniel has to be back at work in 10 minutes, so he would rather purchase food from the vending machine in the cafeteria than the 5-star restaurant across the street.", "sent_2": "Daniel has to be back at work in 10 minutes, so he would rather purchase food from the 5-star restaurant across the street than the vending machine in the cafeteria.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The violin and the piano were both out of tune, but a few minutes later the violinist was ready to play.", "sent_2": "The violin and the piano were both out of tune, but a few minutes later the pianist was ready to play.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Because she hates driving and a long commute, Sam is more likely to opt for the job that's a 30 minute drive away rather than the job that is a 1 hour drive away.", "sent_2": "Because she hates driving and a long commute, Sam is less likely to opt for the job that's a 30 minute drive away rather than the job that is a 1 hour drive away.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "I can visit three cities in a day, but not three continents.", "sent_2": "I can visit three continents in a day, but not three cities.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "With his in-laws arriving for dinner in a few minutes, Carl decides to buy cake rather than bake one. ", "sent_2": "With his in-laws arriving for dinner in a few minutes, Carl decides to bake a cake rather than buy one. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "30 year old scotch is usually better than 2 year old scotch", "sent_2": "30 year old scotch is usually worse than 2 year old scotch", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is better to wait 1 hour than 50 minutes in the fast-food line.", "sent_2": "It is better to wait 50 minutes than 1 hour in the fast-food line.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "With all the rush hour traffic, it's best that John leaves for the airport 30 minutes early rather than just on time.", "sent_2": "With all the rush hour traffic, it's best that John leaves for the airport on time rather than 30 minutes early.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Nicole just got home from a very strenuous hike, so she would rather relax for six minutes than six hours.", "sent_2": "Nicole just got home from a very strenuous hike, so she would rather relax for six hours than six minutes.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If I need to move my fish from one bowl to another, I should make sure they are out of the water for no longer than five seconds instead of five minutes.", "sent_2": "If I need to move my fish from one bowl to another, I should make sure they are out of the water for no longer than five minutes instead of five seconds.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "I need to mow my lawn about once per week, not once per year.", "sent_2": "I need to mow my lawn about once per year, not once per week.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The PC from 2010 that cost $3000 is likely more powerful than a New PC that cost $500.", "sent_2": "The PC from 2010 that cost $3000 is likely less powerful than a New PC that cost $500.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The weather forecast says it will be sunny this week until it starts raining for three days starting Friday, so I will carry an umbrella this Saturday but not this Thursday.", "sent_2": "The weather forecast says it will be sunny this week until it starts raining for three days starting Friday, so I will carry an umbrella this Thursday but not this Saturday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A speeding car is a few meters away from an obstacle. In order to avoid a collision, the driver can take up to two minutes to react instead of reacting immediately.", "sent_2": "A speeding car is a few kilometers away from an obstacle. In order to avoid a collision, the driver can take up to two minutes to react instead of reacting immediately.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If each computer takes 1 hour to build, he should plan to build 7 instead of 14 during his 8 hour shift.", "sent_2": "If each computer takes 1 hour to build, he should plan to build 14 instead of 7 during his 8 hour shift.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "I left an empty bucket under a leak and the next day the water had risen 10 cm in the bucket, so it will be overflowing in a week instead of tomorrow.", "sent_2": "I left an empty bucket under a leak and the next day the water had risen 10 cm in the bucket, so it will be overflowing tomorrow instead of in a week.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A person who has spent more than 16 years of school work is more likely to be promoted in shorter amount of time than a person who has done 8 years of schoolwork.", "sent_2": "A person who has spent more than 16 years of school work is more likely to be promoted in longer amount of time than a person who has done 8 years of school work.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since it looked like it may rain at night, John closed all windows before going to bed instead of in the morning", "sent_2": "Since it looked like it may rain at night, John closed all windows in the morning instead of before going to bed", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Since John has a Zoom meeting early in the afternoon, he would schedule his doctor's appointment for the morning rather than his overseas flight.", "sent_2": "Since John has a Zoom meeting in the early afternoon,  he would schedule his overseas flight for the morning rather than his doctor's appointment.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "10 minutes of continuous rain has a higher chance of causing flooding than 10 days of continuous rain.", "sent_2": "10 minutes of continuous rain has a lower chance of causing flooding than 10 days of continuous rain.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If school starts tomorrow, I should prepare now instead of in two days", "sent_2": "If school starts next week, I should now instead of in a few days ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "He decided to take a 1500-second nap at the station before his train left in 15 minutes.", "sent_2": "He decided to take a 5-minute nap at the station before his train left in 15 minutes.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "When people spend a day at the beach, they're usually there closer to 4 hours than 20 hours.", "sent_2": "When people spend a day at the beach, they're usually there closer to 20 hours than 4 hours.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The average movie probably lasts around 200 minutes, not 10 hours.", "sent_2": "The average movie probably lasts around 10 hours, not 200 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is easier to construct a bridge in 3 days than it is to construct a bridge in 3 years.", "sent_2": "It is more difficult to construct a bridge in 3 days than it is to construct a bridge in 3 years.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": " A smartphone built 10 years ago is more likely to be smaller than one built 1 year ago. ", "sent_2": " A smartphone built 1 year ago is more likely to be smaller one built 10 years ago. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It's getting dark outside and there are no street lights, so I will start walking home now instead of later.", "sent_2": "It's getting dark outside and there are not street lights, so I will start walking home in several hours instead of now. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Since she must leave for work in thirty minutes, she should take a shower instead of a bath.", "sent_2": "Since she must leave for work in thirty minutes, she should take a bath instead of a shower.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "High school students are usually in class for about 6 hours per day, not 12.", "sent_2": "High school students are usually in class for about 12 hours per day, not 6.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}]