[{"sent_1": "Having to go out in two minutes, Carl should wear slip-on shoes instead of sneakers.", "sent_2": "Having to go out in two minutes, Carl should wear sneakers instead of slip-on shoes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since Sally is very tired right now she will clean the kitchen in the morning instead of tonight.", "sent_2": "Since Sally is very tired right now she will clean the kitchen tonight instead of in the morning.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Naomi has a short attention span, so she would have an easier time watching a 1 hour movie instead of a 3 hour movie.", "sent_2": "Naomi has a short attention span, so she would have an easier time watching a 3 hour movie instead of a 1 hour movie.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Having to teach a night class in thirty minutes, he should make a frozen meal instead of a three-course dinner.", "sent_2": "Having to teach a night class in thirty minutes, he should make a three-course dinner instead of a frozen meal.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Barry wants to see a movie with a friend in three days time. He should have told his friend about it four days ago rather than today to give them a week's notice", "sent_2": "Barry wants to see a movie with a friend in three days time. He should tell his friend about it today rather than four days ago to give them a week's notice", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If the movie comes out tomorrow, he should make plans to watch it today rather than 2 days from now.", "sent_2": "If the movie comes out tomorrow, he should make plans to watch it 2 days from now rather than today.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is easier to run one mile in ten minutes, than it is to run two miles in five minutes.", "sent_2": "It is easier to run two miles in five minutes than it is to run one mile in ten minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": " Sonia got up late so  she did 'nt have time for break fast.", "sent_2": "Sonia got up late and so she did 'nt have time for dinner", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since the steak was left cooking on the oven for 3 hours, it was burnt to a crisp. ", "sent_2": "Since the steak was left cooking on the oven for 3 hours, it was not burnt to a crisp. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "My watch is running slow, so I need to add a few minutes to figure out the correct time.", "sent_2": "My watch is running fast, so I need to add a few minutes to figure out the correct time.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "As he has to be at the gym in 5 minutes, he does not have time for a nap.", "sent_2": "As he has to be at the gym in 5 hours, he does not have time for a nap.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "It takes 20 minutes to walk from school to the bus stop and the last bus is 10 minutes after my class ends so I have to leave class 20 minutes early.", "sent_2": "It takes 20 minutes to walk from school to the bus stop and the last bus is 10 minutes after my class ends so I have to leave class 10 minutes early.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "James works six miles from his house, and he normally walks to work. His commute is probably longer than an hour.", "sent_2": "James works six miles from his house, and he normally walks to work. His commute is probably shorter than an thirty minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "John should make sure to zip his pants after he pees", "sent_2": "John should  make sure to zip his pants before he pees.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jack has enrolled for the 4 year engineering course last month and hence he will not graduate at the end of this year.", "sent_2": "Jack has enrolled for the 4 year engineering course last month and hence he will graduate at the end of this year.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The woman had twins, one of whom was born a day after the other.", "sent_2": "The woman had twins, one of whom was born a month after the other.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Robert wanted to watch a movie in the evening show at 7pm,  he left the office 30 minutes before 7pm.", "sent_2": "Robert wanted to watch a movie in the evening show at 7pm,  he left the office 30 minutes before 8pm.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since her daughter's tooth had been loose for a few months, she was not surprised when it fell out today instead of next month.", "sent_2": "Since her daughter's tooth had been loose for a few days, she was not surprised when it fell out today instead of next month.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since it is morning, I will make a pot of coffee.", "sent_2": "Since it is evening, I will make a pot of coffee.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "I like to nap everyday so I have few chances to take an afternoon walk and still get my work done.", "sent_2": "I like to nap everyday so I have many chances to take an afternoon walk and still get my work done.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "The hikers wanted to catch the sunrise at the summit, so they started climbing at midnight. ", "sent_2": "The hikers wanted to catch the sunrise at the summit, so they started climbing at noon. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "1 day after it is born, a cat is physically capable of reproducing.", "sent_2": "1 day after it is born, a cat is not physically capable of reproducing.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As they started on the 2 hour journey from home just now, they will not reach the office in ten minutes for the meeting .", "sent_2": "As they started on the 2 hour journey from home just now, they will reach the office in ten minutes for the meeting.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since dinner needs to be ready by 5:00 pm, I should leave for my weekly grocery trip at 4:00 pm.", "sent_2": "Since dinner needs to be ready by 5:00 pm, I should not leave for my weekly grocery trip at 4:00 pm.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Erica usually gets off work at 5 pm. She rarely sees the janitor that comes in for a night shift.", "sent_2": "Erica usually gets off work at 5 pm. She often sees the janitor that comes in for a night shift.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As she has to be at work in 2 minutes she will not have time to talk.", "sent_2": "As she has to be at work in 2 hours she will not have time to talk.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If the meat is frozen, leaving it at room temperature for 5 minutes will be enough for it to thaw.", "sent_2": "If the meat is frozen, leaving it at room temperature for 500 minutes will be enough for it to thaw.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "John needed to buy a cake for his mother's birthday tomorrow so he planned to go to the bakery this afternoon to get one.", "sent_2": "John needed to buy a cake for his mother's birthday tomorrow so he planned to go to the bakery next week to get one.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "It would be more difficult to catch up in her classes if Petunia missed four days of school rather than one. ", "sent_2": "It would be more difficult to catch up in her classes if Petunia missed one day of school rather than four. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As fall is ending, the nights are getting colder. ", "sent_2": "As spring is ending, the nights are getting colder. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Since I am scheduled to work 4 hours on Friday, I will have plenty of time to schedule personal appointments for that day.", "sent_2": "Since I am scheduled to work 12 hours on Friday, I will have plenty of time to schedule personal appointments for that day.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "As the period for free service of the vehicle was over, Jack had to pay for the last service.", "sent_2": "As the period for free service of the vehicle was over, Jack did not pay for the last service.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Gregory started working at the store when he was eighteen. In two months, he is in basic training.", "sent_2": "Gregory started working at the store when he was eighteen. In two decades, he is in basic training.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since some time is reserved for commercials, the TV program 60 Minutes lasts less than 60 minutes.", "sent_2": "Since some time is reserved for commercials, the TV program 60 Minutes lasts exactly 60 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "I dropped the kids off for the movie at 2PM, so they should be ready for pick-up by 4PM.", "sent_2": "I dropped the kids off for the movie at 4PM, so they should be ready for pick-up at 2PM.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Because I wanted a sweeter banana custard, I waited a day for the bananas to ripen.", "sent_2": "Because I wanted a sweeter banana custard, I waited a month for the bananas to ripen.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you visit the north of Norway during the summer, you'll be able to see the midnight sun.", "sent_2": "If you visit the north of Spain during the summer, you'll be able to see the midnight sun.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Daniel had a train to catch in an hour so he heated his soup in the microwave rather than fire up the wood burning stove.", "sent_2": "Daniel had a a train to catch in an hour so he fired up the wood burning stove rather than heat his soup in the microwave.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Tim's return from China to the U.S. got delayed due to inclement weather causing cancellation of the plane, he will return to work two days later.  ", "sent_2": "Tim's return from China to the U.S. got delayed due to inclement weather causing cancellation of the plane, he will return to work tomorrow.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Peter invited his neighbor Jonathan for dinner, Jonathan arrived on time for dinner.", "sent_2": "Peter invited his neighbor Jonathan for dinner, Jonathan arrived on time for lunch.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Peter got injured in a car accident yesterday, so he is not able to go to work yesterday morning.", "sent_2": "Peter got injured in a car accident yesterday, so he was not able to go to work last Friday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jacob does not have a test until tomorrow so he can study for it today.", "sent_2": "Jacob does not have a test until tomorrow so he can not study for it today.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Because Phil received $30 per hour for working over time, he worked 3 overtime hours so he could buy himself a $70 dollar shirt.", "sent_2": "Because Phil received $30 per hour for working over time, he worked 1 overtime hour so he could buy himself a $70 dollar shirt.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Laura got her paper accepted for publication in March. She decided to start final revision on the paper February of the year.", "sent_2": "Laura got her paper accepted for publication in January. She decided to start final revision on the paper February of the year.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "It's 2 pm and the movie is at 4 pm, so I have time to go buy snacks.", "sent_2": "It's 2 pm and the movie is at 2 pm, so I have time to go buy snacks.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If I want to keep a houseplant healthy, I should place it by a window that gets six hours of sunlight a day.", "sent_2": "If I want to keep a houseplant healthy, I should place it by a window that gets sixty minutes of sunlight a day.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Because the drive was 20 miles long, Beth was able to make it to her destination in under 5 minutes.", "sent_2": "Because the drive was 20 miles long, Beth was able to make it to her destination in under 5 hours.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Amy went outside during November so she decided to wear multiple layers.", "sent_2": "Amy went outside during May so she decided to wear multiple layers.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Jon needed to heat his frozen food so he put it in the microwave for 2 minutes.", "sent_2": "Jon needed to heat his frozen food so he put it in the microwave for 10 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "My school bus arrives in 1 minute, I do not have time to walk home 5 minutes for my umbrella.", "sent_2": "My school bus arrives in 15 minutes, I do not have time to walk home 5 minutes for my umbrella.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Jan wanted some time off his job to attend lunch with his girlfriend, so he asked his manager for a break at 12 PM instead of 12 AM.", "sent_2": "Jan wanted some time off his job to attend lunch with his girlfriend, so he asked his manager for a break at 12 AM instead of 12 PM.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Hoping to have a heart to heart with her friend over lunch, Lisa asked her to take a long lunch break instead of a short one.", "sent_2": "Hoping to have a heart to heart with her friend over lunch, Lisa asked her to take a short lunch break instead of a long one.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "A person will not starve to death if they go one day without eating any food.", "sent_2": "A person will starve to death if they go one day without eating any food.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Paula's school is within a ten minute walk. So she decided to ride a bike.", "sent_2": "Paula's school is within a ten minute walk. So she decided to get on a plane.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Someone who has 1000$ in the bank and gets 4% interest per year, will have more than 1030$ at the end of the first year", "sent_2": "Someone who has 1000$ in the bank and gets 3% interest per year, will have more than 1030$ at the end of the first year", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you want to get Halloween candy on sale you should go one day after Halloween.", "sent_2": "If you want to get Halloween candy on sale you should go one year after Halloween.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The storm is supposed to hit in 50 minutes and I love running in the rain so I'll go on a run in 50 minutes.", "sent_2": "The storm is supposed to hit in 50 minutes and I love running in the rain so I'll go on a run in 5 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If a person in the Europe is having dinner around 8 pm GMT, most people in Australia are asleep", "sent_2": "If a person on the west coast of USA is having dinner around 8 pm, most people in Australia are asleep", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "In the winter time in Canada, I love playing pond hockey.", "sent_2": "In the summer time in Canada, I love playing pond hockey.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "If you want to make a good batch of popcorn, you should microwave it until there is one second between pops.", "sent_2": "If you want to make a good batch of popcorn, you should microwave it until there is one minute between pops.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "For ice skaters training for the Olympics, an hour a day of training is not enough, but six hours a day might be.", "sent_2": "For ice skaters training for the Olympics, an hour a day of training is enough, and six hours a day is excessive.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you're driving right behind someone who suddenly brakes, you might only have a minute or two to react before crashing!", "sent_2": "If you're driving right behind someone who suddenly brakes, you might only have a second or two react before crashing!", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since my last exam is today, I booked a flight home from school that departs tomorrow.", "sent_2": "Since my last exam is today, I booked a flight home from school that departed yesterday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Frida wanted to avoid crowds at the beach, so she went there at  12 am.", "sent_2": "Frida wanted to avoid crowds at the beach, so she went there at 12 pm.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": " If you go to the grocery store and buy flour with the intention of turning it into a cake, you will have to wait about 180 minutes for it to be ready.", "sent_2": " If you go to the grocery store and buy flour with the intention of turning it into a cake, you will have to wait about 18 minutes for it to be ready.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since my doctor's appointment is at noon and it takes twenty minutes to get there, I should leave by 11:45 am.", "sent_2": "Since my doctor's appointment is at noon and it takes ten minutes to get there, I should leave by 11:45 am.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since I don't have to work on Saturday, I can plan to go out of town for the day.", "sent_2": "Since I have to work on Saturday, I can't plan to go out of town for the day.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Hayden was 17 years old, so he knew it was time to start looking into what colleges he is interested in. ", "sent_2": "Hayden was 17 months old, so he knew it was time to start looking into what colleges he is interested in. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The criminal had only nine minutes to get away after the alarm was sounded, so he made sure the get-away car was just across the street", "sent_2": "The criminal had only nine minutes to get away after the alarm was sounded, so he made sure the get-away car was far from the scene.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "If you feel a cramp in your legs, you should stretch your legs to relieve some of the tension.", "sent_2": "If you feel a cramp in your legs, you should bend your legs to relieve some of the tension.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Today is January 21, and Valentine's Day is on February 14, so I have plenty of time to search for and land a date for the day of lovers.", "sent_2": "Today is January 21, and Valentine's Day is on February 14, so I don't have enough time to search for and land a date for the day of lovers.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "The movie does not start for 3 hours so Tate has time to eat dinner first.", "sent_2": "The movie does not start for 3 hours so Tate does not have time to eat dinner first.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Laura has been trying to memorize a Beethoven Piano Sonata. It took her five weeks.", "sent_2": "Laura has been trying to memorize a Beethoven Piano Sonata. It took her one hour.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "True"}, {"sent_1": "Since he'd be driving in the middle of the day, John was sure to take his sunglasses.", "sent_2": "Since he'd be driving in the middle of the night, John was sure to take his sunglasses.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "causal", "numeracy": "False"}, {"sent_1": "Amber has a class in a few minutes, she would prefer to eat a quick lunch before going to class instead of going grocery shopping.", "sent_2": "Amber has a class in a few minutes she would prefer to go grocery shopping before going to class instead of eating a quick lunch. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "As I have to be at work in one hour, I will do the dishes now and go to the laundromat later.", "sent_2": "As I have to be at work in one hour, I will go to the laundromat now and do the dishes later.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If John wants to see the sunset, he should start watching at 7:00 pm instead of 5:00 pm.", "sent_2": "If John wants to see the sunset, he should start watching at 5:00 pm instead of 7:00 pm.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A person born 8 years ago has not lived longer than a person born 80 months ago.", "sent_2": "A person born 8 years ago has lived longer than a person born 80 months ago.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Sarah starts college in 3 months, so she should choose her classes in the next month rather than the next year.", "sent_2": "Sarah starts college in 3 months, so she should choose her classes in the next year rather than the next month.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "John has an important job interview on Monday morning, so he would rather go partying on Saturday night than on Sunday night.", "sent_2": "John has an important job interview on Monday morning, so he would rather go partying on Saturday night than on Sunday night.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "His exam started in twenty minutes, so he decided he'd take an hour-long nap afterward instead of before.", "sent_2": "His exam started in twenty minutes, so he decided he'd take an hour-long nap before it instead of afterward.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is better for Bert’s health if he quits smoking after one year than after five. ", "sent_2": "It is better for Bert’s health if he quits smoking after five years than after one. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A son visiting his parents after 2 years is likely to carry special gifts for them than a son who vist them every day.", "sent_2": "A son visiting his parents every day is likely to carry special gifts for them than a son who vist them after 2 years.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is safer to drink milk after it's been refrigerated for 1 week rather than 20 weeks.", "sent_2": "It is safer to drink milk after it's been refrigerated for 20 weeks rather than 1 week.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Ruby was seven months pregnant in October, so she expected to be even bigger in November, but smaller by January.", "sent_2": "Ruby was four months pregnant in October, so she expected to be even bigger in November, but smaller by January.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Work done at 5 hours per day for 10 days is same as work done at 10 hours per day for 5 days.   ", "sent_2": "Work done at 5 hours per day for 10 days is not same as work done at 10 hours per day for 5 days.   ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Because the museum's security is worse at night, Tim should rob the museum at 3:00 am instead of 3:00 pm.", "sent_2": "Because the museum's security is worse at night, Tim should rob the museum at 3:00 pm instead of 3:00 am.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Maggie in the US sent a letter to her boyfriend living in Europe. She expects it to arrive today rather than next month.", "sent_2": "Maggie in the US sent a letter to her boyfriend living in Europe. She expects it to arrive next month rather than today.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The immunity of an adult of age 21 years is generally better than a child of age 10 years.", "sent_2": " The immunity of a child of age 10 years is generally better than an adult of age 21 years.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since my friend's birthday is today, I should wish her a happy birthday today rather than yesterday.", "sent_2": "Since my friend's birthday is today, I should have wished her a happy birthday yesterday rather than now.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Amy wanted to make a pizza for dinner so she put the pizza in the oven for 2 hours rather than 15 minutes.", "sent_2": "Amy wanted to make a pizza for dinner so she put the pizza in the oven for 15 minutes rather than 2 hours.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It makes more sense to eat breakfast before bed time than it does to eat dinner.", "sent_2": "It makes more sense to eat dinner before bed time than it does to eat breakfast.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Peter and Paul work at night in alternate days, meaning Peter works one night, next night Paul and so on, last Monday Peter was at work, so this Monday Paul will be at work and not Peter.", "sent_2": "Peter and Paul work at night in alternate days, meaning Peter works one night, next night Paul and so on, last Monday Peter was at work, so this Monday Peter will be at work and not Peter.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since Joe would only drink coffee that he'd heated in the microwave for at least a minute, he decided to heat it for 65 seconds instead of 650 seconds.", "sent_2": "Since Joe would only drink coffee that he'd heated in the microwave for at least a minute, he decided to heat it for 650 seconds instead of 65 seconds.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "James' bus comes at 6:30 AM and he woke up at 6:28 AM, so he'll skip breakfast instead of making pancakes.", "sent_2": "James' bus comes at 6:30 AM and he woke up at 4:30 AM, so he'll make pancakes instead of skipping breakfast.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "My arms hurt after reading for too many hours this heavy book. Next time I'll buy a single volume instead of another omnibus.", "sent_2": "My arms hurt after reading for too many hours this heavy book. Next time I'll buy another omnibus instead of a single volume.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "John had to get up early Saturday, so he went to bed early on Friday instead of staying up late.", "sent_2": "John had to get up early Saturday, so he went to bed extra late on Friday instead of turning in early", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The movie was starting in ten minutes, so the couple decided to have dinner afterward instead of before the movie.", "sent_2": "The movie was starting in ten minutes, so the couple decided to have dinner before the movie instead of afterward", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A shirt bought yesterday is in much better shape than one bought fifty years ago.", "sent_2": "A shirt bought fifty years ago is in much better shape than one bought yesterday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If Granny starts making the tea now, you can have hot tea sooner than ice tea.", "sent_2": "If Granny starts making the tea now, you can have ice tea sooner than hot tea.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "I brought a lot of work to do tonight, so I should make sure dinner takes 30 minutes rather than 3 hours.", "sent_2": "I brought a lot of work to do tonight, so I should make sure dinner takes 3 hours rather than 30 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Daniel has to be back at work in 10 minutes, so he would rather purchase food from the vending machine in the cafeteria than the 5-star restaurant across the street.", "sent_2": "Daniel has to be back at work in 10 minutes, so he would rather purchase food from the 5-star restaurant across the street than the vending machine in the cafeteria.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The violin and the piano were both out of tune, but a few minutes later the violinist was ready to play.", "sent_2": "The violin and the piano were both out of tune, but a few minutes later the pianist was ready to play.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Because she hates driving and a long commute, Sam is more likely to opt for the job that's a 30 minute drive away rather than the job that is a 1 hour drive away.", "sent_2": "Because she hates driving and a long commute, Sam is less likely to opt for the job that's a 30 minute drive away rather than the job that is a 1 hour drive away.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "I can visit three cities in a day, but not three continents.", "sent_2": "I can visit three continents in a day, but not three cities.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "With his in-laws arriving for dinner in a few minutes, Carl decides to buy cake rather than bake one. ", "sent_2": "With his in-laws arriving for dinner in a few minutes, Carl decides to bake a cake rather than buy one. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "30 year old scotch is usually better than 2 year old scotch", "sent_2": "30 year old scotch is usually worse than 2 year old scotch", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is better to wait 1 hour than 50 minutes in the fast-food line.", "sent_2": "It is better to wait 50 minutes than 1 hour in the fast-food line.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "With all the rush hour traffic, it's best that John leaves for the airport 30 minutes early rather than just on time.", "sent_2": "With all the rush hour traffic, it's best that John leaves for the airport on time rather than 30 minutes early.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Nicole just got home from a very strenuous hike, so she would rather relax for six minutes than six hours.", "sent_2": "Nicole just got home from a very strenuous hike, so she would rather relax for six hours than six minutes.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If I need to move my fish from one bowl to another, I should make sure they are out of the water for no longer than five seconds instead of five minutes.", "sent_2": "If I need to move my fish from one bowl to another, I should make sure they are out of the water for no longer than five minutes instead of five seconds.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "I need to mow my lawn about once per week, not once per year.", "sent_2": "I need to mow my lawn about once per year, not once per week.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "The PC from 2010 that cost $3000 is likely more powerful than a New PC that cost $500.", "sent_2": "The PC from 2010 that cost $3000 is likely less powerful than a New PC that cost $500.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The weather forecast says it will be sunny this week until it starts raining for three days starting Friday, so I will carry an umbrella this Saturday but not this Thursday.", "sent_2": "The weather forecast says it will be sunny this week until it starts raining for three days starting Friday, so I will carry an umbrella this Thursday but not this Saturday.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A speeding car is a few meters away from an obstacle. In order to avoid a collision, the driver can take up to two minutes to react instead of reacting immediately.", "sent_2": "A speeding car is a few kilometers away from an obstacle. In order to avoid a collision, the driver can take up to two minutes to react instead of reacting immediately.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If each computer takes 1 hour to build, he should plan to build 7 instead of 14 during his 8 hour shift.", "sent_2": "If each computer takes 1 hour to build, he should plan to build 14 instead of 7 during his 8 hour shift.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "I left an empty bucket under a leak and the next day the water had risen 10 cm in the bucket, so it will be overflowing in a week instead of tomorrow.", "sent_2": "I left an empty bucket under a leak and the next day the water had risen 10 cm in the bucket, so it will be overflowing tomorrow instead of in a week.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "A person who has spent more than 16 years of school work is more likely to be promoted in shorter amount of time than a person who has done 8 years of schoolwork.", "sent_2": "A person who has spent more than 16 years of school work is more likely to be promoted in longer amount of time than a person who has done 8 years of school work.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "Since it looked like it may rain at night, John closed all windows before going to bed instead of in the morning", "sent_2": "Since it looked like it may rain at night, John closed all windows in the morning instead of before going to bed", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Since John has a Zoom meeting early in the afternoon, he would schedule his doctor's appointment for the morning rather than his overseas flight.", "sent_2": "Since John has a Zoom meeting in the early afternoon,  he would schedule his overseas flight for the morning rather than his doctor's appointment.  ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "10 minutes of continuous rain has a higher chance of causing flooding than 10 days of continuous rain.", "sent_2": "10 minutes of continuous rain has a lower chance of causing flooding than 10 days of continuous rain.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "If school starts tomorrow, I should prepare now instead of in two days", "sent_2": "If school starts next week, I should now instead of in a few days ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "He decided to take a 1500-second nap at the station before his train left in 15 minutes.", "sent_2": "He decided to take a 5-minute nap at the station before his train left in 15 minutes.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "When people spend a day at the beach, they're usually there closer to 4 hours than 20 hours.", "sent_2": "When people spend a day at the beach, they're usually there closer to 20 hours than 4 hours.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "The average movie probably lasts around 200 minutes, not 10 hours.", "sent_2": "The average movie probably lasts around 10 hours, not 200 minutes.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It is easier to construct a bridge in 3 days than it is to construct a bridge in 3 years.", "sent_2": "It is more difficult to construct a bridge in 3 days than it is to construct a bridge in 3 years.", "label_1": "False", "label_2": "True", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": " A smartphone built 10 years ago is more likely to be smaller than one built 1 year ago. ", "sent_2": " A smartphone built 1 year ago is more likely to be smaller one built 10 years ago. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "It's getting dark outside and there are no street lights, so I will start walking home now instead of later.", "sent_2": "It's getting dark outside and there are not street lights, so I will start walking home in several hours instead of now. ", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "False"}, {"sent_1": "Since she must leave for work in thirty minutes, she should take a shower instead of a bath.", "sent_2": "Since she must leave for work in thirty minutes, she should take a bath instead of a shower.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}, {"sent_1": "High school students are usually in class for about 6 hours per day, not 12.", "sent_2": "High school students are usually in class for about 12 hours per day, not 6.", "label_1": "True", "label_2": "False", "domain": "time", "scenario": "comparison", "numeracy": "True"}]